import os
from art import tprint
def clear_screen():
    os.system('cls' if os.name == 'nt' else 'clear')
def show_banner():
    banner = """
        ╔═══════════════════════════════════════════╗
        ║                                           ║
        ║      ███╗   ███╗ █████╗  ██████╗ ██╗      ║
        ║      ████╗ ████║██╔══██╗██╔════╝ ██║      ║
        ║      ██╔████╔██║███████║██║  ███╗██║      ║ 
        ║      ██║╚██╔╝██║██╔══██║██║   ██║██║      ║
        ║      ██║ ╚═╝ ██║██║  ██║╚██████╔╝██║      ║
        ║      ╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═╝      ║
        ║                                           ║
        ╚═══════════════════════════════════════════╝
        ---------三  贤  人  决  策  系  统 ----------
            """
    print(banner)
def declaration():
    print('作者声明'.center(30,'='))
    print('本作品仅供学习,请勿商用')
    print('本作品中的-magi-仅供娱乐，千万别相信啊>_<')
    print('有任何问题--邮箱：3656885944@qq.com--将会十分感谢您的反馈')
    tprint('EVANGELION',font='slant')
